"""
Написать программу, которая спрашивает имя пользователя и здоровается с ним.
"""

name = input("Введите ваше имя: ")
print(f"Здравствуйте, {name}!")
